vishamaev/ChibiOS/os/common/ext/Artery/AT32F4xx/at32f435xx.h
#include "core_cm4.h"             /* Cortex-M4 processor and core peripherals */
#include "system_at32f4xx.h"
#include <stdint.h>

#if 1
// --- Exported from at32f435_437.h Begin       ++VS
/** @addtogroup Exported_types
  * @{
  */

typedef int32_t  INT32;
typedef int16_t  INT16;
typedef int8_t   INT8;
typedef uint32_t UINT32;
typedef uint16_t UINT16;
typedef uint8_t  UINT8;

typedef int32_t  s32;
typedef int16_t  s16;
typedef int8_t   s8;

typedef const int32_t sc32;   /*!< read only */
typedef const int16_t sc16;   /*!< read only */
typedef const int8_t  sc8;    /*!< read only */

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;    /*!< read only */
typedef __I int16_t vsc16;    /*!< read only */
typedef __I int8_t  vsc8;     /*!< read only */

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  /*!< read only */
typedef const uint16_t uc16;  /*!< read only */
typedef const uint8_t  uc8;   /*!< read only */

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;   /*!< read only */
typedef __I uint16_t vuc16;   /*!< read only */
typedef __I uint8_t  vuc8;    /*!< read only */

#if 1
typedef enum { RESET = 0, SET  = !RESET}    flag_status;
//typedef enum { FALSE = 0, TRUE = !FALSE}    confirm_state;
typedef enum { ERROR = 0, SUCCESS = !ERROR} error_status;
#endif

/**
  * @}
  */

/** @addtogroup Exported_macro
  * @{
  */

#define REG8(addr)                       *(volatile uint8_t *)(addr)
#define REG16(addr)                      *(volatile uint16_t *)(addr)
#define REG32(addr)                      *(volatile uint32_t *)(addr)

#define MAKE_VALUE(reg_offset, bit_num)  (((reg_offset) << 16) | (bit_num & 0x1f))

#define PERIPH_REG(periph_base, value)   REG32((periph_base + (value >> 16)))
#define PERIPH_REG_BIT(value)            (0x1u << (value & 0x1f))

/**
  * @}
  */

/** @addtogroup Peripheral_memory_map
  * @{
  */

#define XMC_SDRAM_MEM_BASE               ((uint32_t)0xC0000000U)
#define QSPI2_MEM_BASE                   ((uint32_t)0xB0000000U)
#define XMC_CARD_MEM_BASE                ((uint32_t)0xA8000000U)
#define QSPI2_REG_BASE                   ((uint32_t)0xA0002000U)
#define QSPI1_REG_BASE                   ((uint32_t)0xA0001000U)
#define XMC_REG_BASE                     ((uint32_t)0xA0000000U)
#define XMC_BANK1_REG_BASE               (XMC_REG_BASE + 0x0000U)
#define XMC_BANK2_REG_BASE               (XMC_REG_BASE + 0x0060U)
#define XMC_BANK3_REG_BASE               (XMC_REG_BASE + 0x0080U)
#define XMC_BANK4_REG_BASE               (XMC_REG_BASE + 0x00A0U)
#define XMC_SDRAM_REG_BASE               (XMC_REG_BASE + 0x0140U)
#define QSPI1_MEM_BASE                   ((uint32_t)0x90000000U)
#define XMC_MEM_BASE                     ((uint32_t)0x60000000U)
#define PERIPH_BASE                      ((uint32_t)0x40000000U)
#define SRAM_BB_BASE                     ((uint32_t)0x22000000U)
#define PERIPH_BB_BASE                   ((uint32_t)0x42000000U)
#define SRAM_BASE                        ((uint32_t)0x20000000U)
#define USD_BASE                         ((uint32_t)0x1FFFC000U)
#define FLASH_BASE                       ((uint32_t)0x08000000U)

#define DEBUG_BASE                       ((uint32_t)0xE0042000)

#define APB1PERIPH_BASE                  (PERIPH_BASE)
#define APB2PERIPH_BASE                  (PERIPH_BASE + 0x10000U)
#define AHBPERIPH1_BASE                  (PERIPH_BASE + 0x20000U)
#define AHBPERIPH2_BASE                  (PERIPH_BASE + 0x10000000U)

#if defined (AT32F435xx)
/* apb1 bus base address */
#define UART8_BASE                       (APB1PERIPH_BASE + 0x7C00U)
#define UART7_BASE                       (APB1PERIPH_BASE + 0x7800U)
#define DAC_BASE                         (APB1PERIPH_BASE + 0x7400U)
#define PWC_BASE                         (APB1PERIPH_BASE + 0x7000U)
#define CAN2_BASE                        (APB1PERIPH_BASE + 0x6800U)
#define CAN1_BASE                        (APB1PERIPH_BASE + 0x6400U)
#define I2C3_BASE                        (APB1PERIPH_BASE + 0x5C00U)
#define I2C2_BASE                        (APB1PERIPH_BASE + 0x5800U)
#define I2C1_BASE                        (APB1PERIPH_BASE + 0x5400U)
#define UART5_BASE                       (APB1PERIPH_BASE + 0x5000U)
#define UART4_BASE                       (APB1PERIPH_BASE + 0x4C00U)
#define USART3_BASE                      (APB1PERIPH_BASE + 0x4800U)
#define USART2_BASE                      (APB1PERIPH_BASE + 0x4400U)
#define SPI3_BASE                        (APB1PERIPH_BASE + 0x3C00U)
#define SPI2_BASE                        (APB1PERIPH_BASE + 0x3800U)
#define WDT_BASE                         (APB1PERIPH_BASE + 0x3000U)
#define WWDT_BASE                        (APB1PERIPH_BASE + 0x2C00U)
#define ERTC_BASE                        (APB1PERIPH_BASE + 0x2800U)
#define TMR14_BASE                       (APB1PERIPH_BASE + 0x2000U)     /* */
#define TMR13_BASE                       (APB1PERIPH_BASE + 0x1C00U)     /* */
#define TMR12_BASE                       (APB1PERIPH_BASE + 0x1800U)     /* */
#define TMR7_BASE                        (APB1PERIPH_BASE + 0x1400U)     /* */
#define TMR6_BASE                        (APB1PERIPH_BASE + 0x1000U)     /* */
#define TMR5_BASE                        (APB1PERIPH_BASE + 0x0C00U)     /* */
#define TMR4_BASE                        (APB1PERIPH_BASE + 0x0800U)     /* */
#define TMR3_BASE                        (APB1PERIPH_BASE + 0x0400U)     /* */
#define TMR2_BASE                        (APB1PERIPH_BASE + 0x0000U)     /* */
/* apb2 bus base address */
#define I2S2EXT_BASE                     (APB2PERIPH_BASE + 0x7800U)
#define I2S3EXT_BASE                     (APB2PERIPH_BASE + 0x7C00U)
#define ACC_BASE                         (APB2PERIPH_BASE + 0x7400U)
#define TMR20_BASE                       (APB2PERIPH_BASE + 0x4C00U)     /* TIM20_BASE (APB2PERIPH_BASE + 0x4C00U) */
#define TMR11_BASE                       (APB2PERIPH_BASE + 0x4800U)     /* */
#define TMR10_BASE                       (APB2PERIPH_BASE + 0x4400U)     /* */
#define TMR9_BASE                        (APB2PERIPH_BASE + 0x4000U)     /* */
#define EXINT_BASE                       (APB2PERIPH_BASE + 0x3C00U)
#define SCFG_BASE                        (APB2PERIPH_BASE + 0x3800U)
#define SPI4_BASE                        (APB2PERIPH_BASE + 0x3400U)
#define SPI1_BASE                        (APB2PERIPH_BASE + 0x3000U)
#define ADC1_BASE                        (APB2PERIPH_BASE + 0x2000U)
#define ADC2_BASE                        (APB2PERIPH_BASE + 0x2100U)
#define ADC3_BASE                        (APB2PERIPH_BASE + 0x2200U)
#define ADCCOM_BASE                      (APB2PERIPH_BASE + 0x2300U)
#define ADC123_COMMON_BASE                ADCCOM_BASE
/* Legacy define */
#define ADC_BASE                          ADC123_COMMON_BASE

#define USART6_BASE                      (APB2PERIPH_BASE + 0x1400U)
#define USART1_BASE                      (APB2PERIPH_BASE + 0x1000U)
#define TMR8_BASE                        (APB2PERIPH_BASE + 0x0400U)     /*  */
#define TMR1_BASE                        (APB2PERIPH_BASE + 0x0000U)     /* TIM1_BASE  (APB2PERIPH_BASE + 0x0000U) */
/* ahb bus base address */
#define OTGFS2_BASE                      (AHBPERIPH1_BASE + 0x20000U)
#define SDIO1_BASE                       (AHBPERIPH1_BASE + 0xC400U)
#define GPIOH_BASE                       (AHBPERIPH1_BASE + 0x1C00U)
#define GPIOG_BASE                       (AHBPERIPH1_BASE + 0x1800U)
#define GPIOF_BASE                       (AHBPERIPH1_BASE + 0x1400U)
#define GPIOE_BASE                       (AHBPERIPH1_BASE + 0x1000U)
#define GPIOD_BASE                       (AHBPERIPH1_BASE + 0x0C00U)
#define GPIOC_BASE                       (AHBPERIPH1_BASE + 0x0800U)
#define GPIOB_BASE                       (AHBPERIPH1_BASE + 0x0400U)
#define GPIOA_BASE                       (AHBPERIPH1_BASE + 0x0000U)

#define DMA1_BASE                        (AHBPERIPH1_BASE + 0x6400U)
#define DMA1_CHANNEL1_BASE               (DMA1_BASE + 0x0008U)
#define DMA1_CHANNEL2_BASE               (DMA1_BASE + 0x001CU)
#define DMA1_CHANNEL3_BASE               (DMA1_BASE + 0x0030U)
#define DMA1_CHANNEL4_BASE               (DMA1_BASE + 0x0044U)
#define DMA1_CHANNEL5_BASE               (DMA1_BASE + 0x0058U)
#define DMA1_CHANNEL6_BASE               (DMA1_BASE + 0x006CU)
#define DMA1_CHANNEL7_BASE               (DMA1_BASE + 0x0080U)

#define DMA1                             ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Channel1_BASE                DMA1_CHANNEL1_BASE
#define DMA1_Channel2_BASE                DMA1_CHANNEL2_BASE
#define DMA1_Channel3_BASE                DMA1_CHANNEL3_BASE
#define DMA1_Channel4_BASE                DMA1_CHANNEL4_BASE
#define DMA1_Channel5_BASE                DMA1_CHANNEL5_BASE
#define DMA1_Channel6_BASE                DMA1_CHANNEL6_BASE
#define DMA1_Channel7_BASE                DMA1_CHANNEL7_BASE

#define DMA1MUX_BASE                     (DMA1_BASE + 0x0104U)
#define DMA1MUX_CHANNEL1_BASE            (DMA1MUX_BASE)
#define DMA1MUX_CHANNEL2_BASE            (DMA1MUX_BASE + 0x0004U)
#define DMA1MUX_CHANNEL3_BASE            (DMA1MUX_BASE + 0x0008U)
#define DMA1MUX_CHANNEL4_BASE            (DMA1MUX_BASE + 0x000CU)
#define DMA1MUX_CHANNEL5_BASE            (DMA1MUX_BASE + 0x0010U)
#define DMA1MUX_CHANNEL6_BASE            (DMA1MUX_BASE + 0x0014U)
#define DMA1MUX_CHANNEL7_BASE            (DMA1MUX_BASE + 0x0018U)

#define DMAMUX1_BASE                     DMA1MUX_BASE


#define DMA1MUX_GENERATOR1_BASE          (DMA1_BASE + 0x0120U)
#define DMA1MUX_GENERATOR2_BASE          (DMA1_BASE + 0x0124U)
#define DMA1MUX_GENERATOR3_BASE          (DMA1_BASE + 0x0128U)
#define DMA1MUX_GENERATOR4_BASE          (DMA1_BASE + 0x012CU)

#define DMA2_BASE                        (AHBPERIPH1_BASE + 0x6600U)
#define DMA2_CHANNEL1_BASE               (DMA2_BASE + 0x0008U)
#define DMA2_CHANNEL2_BASE               (DMA2_BASE + 0x001CU)
#define DMA2_CHANNEL3_BASE               (DMA2_BASE + 0x0030U)
#define DMA2_CHANNEL4_BASE               (DMA2_BASE + 0x0044U)
#define DMA2_CHANNEL5_BASE               (DMA2_BASE + 0x0058U)
#define DMA2_CHANNEL6_BASE               (DMA2_BASE + 0x006CU)
#define DMA2_CHANNEL7_BASE               (DMA2_BASE + 0x0080U)

#define DMA2                             ((DMA_TypeDef *) DMA2_BASE)
#define DMA2_Channel1_BASE               DMA2_CHANNEL1_BASE
#define DMA2_Channel2_BASE               DMA2_CHANNEL2_BASE
#define DMA2_Channel3_BASE               DMA2_CHANNEL3_BASE
#define DMA2_Channel4_BASE               DMA2_CHANNEL4_BASE
#define DMA2_Channel5_BASE               DMA2_CHANNEL5_BASE
#define DMA2_Channel6_BASE               DMA2_CHANNEL6_BASE
#define DMA2_Channel7_BASE               DMA2_CHANNEL7_BASE


#define DMA2MUX_BASE                     (DMA2_BASE + 0x0104U)
#define DMA2MUX_CHANNEL1_BASE            (DMA2MUX_BASE)
#define DMA2MUX_CHANNEL2_BASE            (DMA2MUX_BASE + 0x0004U)
#define DMA2MUX_CHANNEL3_BASE            (DMA2MUX_BASE + 0x0008U)
#define DMA2MUX_CHANNEL4_BASE            (DMA2MUX_BASE + 0x000CU)
#define DMA2MUX_CHANNEL5_BASE            (DMA2MUX_BASE + 0x0010U)
#define DMA2MUX_CHANNEL6_BASE            (DMA2MUX_BASE + 0x0014U)
#define DMA2MUX_CHANNEL7_BASE            (DMA2MUX_BASE + 0x0018U)

#define DMA2MUX_GENERATOR1_BASE          (DMA2_BASE + 0x0120U)
#define DMA2MUX_GENERATOR2_BASE          (DMA2_BASE + 0x0124U)
#define DMA2MUX_GENERATOR3_BASE          (DMA2_BASE + 0x0128U)
#define DMA2MUX_GENERATOR4_BASE          (DMA2_BASE + 0x012CU)

#define EDMA1_BASE                        (AHBPERIPH1_BASE + 0x6000U)
#define EDMA1_STREAM1_BASE                (EDMA1_BASE + 0x0010U)
#define EDMA1_STREAM2_BASE                (EDMA1_BASE + 0x0028U)
#define EDMA1_STREAM3_BASE                (EDMA1_BASE + 0x0040U)
#define EDMA1_STREAM4_BASE                (EDMA1_BASE + 0x0058U)
#define EDMA1_STREAM5_BASE                (EDMA1_BASE + 0x0070U)
#define EDMA1_STREAM6_BASE                (EDMA1_BASE + 0x0088U)
#define EDMA1_STREAM7_BASE                (EDMA1_BASE + 0x00A0U)
#define EDMA1_STREAM8_BASE                (EDMA1_BASE + 0x00B8U)

