vishamaev/ChibiOS/os/common/ext/Artery/AT32F4xx/at32f435xx.h
#define EDMA_2D_BASE                     (EDMA1_BASE + 0x00F4U)
#define EDMA_STREAM1_2D_BASE             (EDMA_2D_BASE + 0x0004U)
#define EDMA_STREAM2_2D_BASE             (EDMA_2D_BASE + 0x000CU)
#define EDMA_STREAM3_2D_BASE             (EDMA_2D_BASE + 0x0014U)
#define EDMA_STREAM4_2D_BASE             (EDMA_2D_BASE + 0x001CU)
#define EDMA_STREAM5_2D_BASE             (EDMA_2D_BASE + 0x0024U)
#define EDMA_STREAM6_2D_BASE             (EDMA_2D_BASE + 0x002CU)
#define EDMA_STREAM7_2D_BASE             (EDMA_2D_BASE + 0x0034U)
#define EDMA_STREAM8_2D_BASE             (EDMA_2D_BASE + 0x003CU)

#define EDMA_LL_BASE                     (EDMA1_BASE + 0x00D0U)
#define EDMA_STREAM1_LL_BASE             (EDMA_LL_BASE + 0x0004U)
#define EDMA_STREAM2_LL_BASE             (EDMA_LL_BASE + 0x0008U)
#define EDMA_STREAM3_LL_BASE             (EDMA_LL_BASE + 0x000CU)
#define EDMA_STREAM4_LL_BASE             (EDMA_LL_BASE + 0x0010U)
#define EDMA_STREAM5_LL_BASE             (EDMA_LL_BASE + 0x0014U)
#define EDMA_STREAM6_LL_BASE             (EDMA_LL_BASE + 0x0018U)
#define EDMA_STREAM7_LL_BASE             (EDMA_LL_BASE + 0x001CU)
#define EDMA_STREAM8_LL_BASE             (EDMA_LL_BASE + 0x0020U)

#define EDMAMUX_BASE                     (EDMA1_BASE + 0x0140U)
#define EDMAMUX_CHANNEL1_BASE            (EDMAMUX_BASE)
#define EDMAMUX_CHANNEL2_BASE            (EDMAMUX_BASE + 0x0004U)
#define EDMAMUX_CHANNEL3_BASE            (EDMAMUX_BASE + 0x0008U)
#define EDMAMUX_CHANNEL4_BASE            (EDMAMUX_BASE + 0x000CU)
#define EDMAMUX_CHANNEL5_BASE            (EDMAMUX_BASE + 0x0010U)
#define EDMAMUX_CHANNEL6_BASE            (EDMAMUX_BASE + 0x0014U)
#define EDMAMUX_CHANNEL7_BASE            (EDMAMUX_BASE + 0x0018U)
#define EDMAMUX_CHANNEL8_BASE            (EDMAMUX_BASE + 0x001CU)

#define EDMAMUX_GENERATOR1_BASE          (EDMA1_BASE + 0x0160U)
#define EDMAMUX_GENERATOR2_BASE          (EDMA1_BASE + 0x0164U)
#define EDMAMUX_GENERATOR3_BASE          (EDMA1_BASE + 0x0168U)
#define EDMAMUX_GENERATOR4_BASE          (EDMA1_BASE + 0x016CU)

#define FLASH_REG_BASE                   (AHBPERIPH1_BASE + 0x3C00U)
#define CRM_BASE                         (AHBPERIPH1_BASE + 0x3800U)
#define CRC_BASE                         (AHBPERIPH1_BASE + 0x3000U)
#define SDIO2_BASE                       (AHBPERIPH2_BASE + 0x61000U)
#define DVP_BASE                         (AHBPERIPH2_BASE + 0x50000U)
#define OTGFS1_BASE                      (AHBPERIPH2_BASE + 0x00000U)
#endif
// --- Exported from at32f435_437.h End  ++VS

//For STM32
#define TIM1_BASE       TMR1_BASE
#define TIM2_BASE       TMR2_BASE
#define TIM3_BASE       TMR3_BASE
#define TIM4_BASE       TMR4_BASE
#define TIM5_BASE       TMR5_BASE
#define TIM6_BASE       TMR6_BASE
#define TIM7_BASE       TMR7_BASE
#define TIM8_BASE       TMR8_BASE
#define TIM9_BASE       TMR9_BASE
#define TIM10_BASE      TMR10_BASE
#define TIM11_BASE      TMR11_BASE
#define TIM12_BASE      TMR12_BASE
#define TIM13_BASE      TMR13_BASE
#define TIM14_BASE      TMR14_BASE
#define TIM15_BASE      TMR15_BASE
#define TIM16_BASE      TMR16_BASE
#define TIM17_BASE      TMR17_BASE
#define TIM18_BASE      TMR18_BASE
#define TIM19_BASE      TMR19_BASE
#define TIM20_BASE      TMR20_BASE

//#define PWR_BASE                  (APB1PERIPH_BASE + 0x7000U)
#define PWR_BASE        PWC_BASE  //(APB1PERIPH_BASE + 0x7000)
//#define RCC_BASE                    (AHB1PERIPH_BASE + 0x3800U)
#define RCC_BASE        CRM_BASE    //(AHBPERIPH1_BASE + 0x3800)
//#define DBGMCU_BASE                              0xE0042000U
#define DBGMCU_BASE     DEBUG_BASE  //  ((uint32_t)0xE0042000)


#endif


/** @addtogroup Peripheral_registers_structures
  * @{
  */

/** 
  * @brief Analog to Digital Converter  
  */

typedef struct {
  __IO uint32_t SR;     /*!< ADC status register,                         Address offset: 0x00 */
  __IO uint32_t CR1;    /*!< ADC control register 1,                      Address offset: 0x04 */
  __IO uint32_t CR2;    /*!< ADC control register 2,                      Address offset: 0x08 */
  __IO uint32_t SMPR1;  /*!< ADC sample time register 1,                  Address offset: 0x0C */
  __IO uint32_t SMPR2;  /*!< ADC sample time register 2,                  Address offset: 0x10 */
  __IO uint32_t JOFR1;  /*!< ADC injected channel data offset register 1, Address offset: 0x14 */
  __IO uint32_t JOFR2;  /*!< ADC injected channel data offset register 2, Address offset: 0x18 */
  __IO uint32_t JOFR3;  /*!< ADC injected channel data offset register 3, Address offset: 0x1C */
  __IO uint32_t JOFR4;  /*!< ADC injected channel data offset register 4, Address offset: 0x20 */
  __IO uint32_t HTR;    /*!< ADC watchdog higher threshold register,      Address offset: 0x24 */
  __IO uint32_t LTR;    /*!< ADC watchdog lower threshold register,       Address offset: 0x28 */
  __IO uint32_t SQR1;   /*!< ADC regular sequence register 1,             Address offset: 0x2C */
  __IO uint32_t SQR2;   /*!< ADC regular sequence register 2,             Address offset: 0x30 */
  __IO uint32_t SQR3;   /*!< ADC regular sequence register 3,             Address offset: 0x34 */
  __IO uint32_t JSQR;   /*!< ADC injected sequence register,              Address offset: 0x38*/
  __IO uint32_t JDR1;   /*!< ADC injected data register 1,                Address offset: 0x3C */
  __IO uint32_t JDR2;   /*!< ADC injected data register 2,                Address offset: 0x40 */
  __IO uint32_t JDR3;   /*!< ADC injected data register 3,                Address offset: 0x44 */
  __IO uint32_t JDR4;   /*!< ADC injected data register 4,                Address offset: 0x48 */
  __IO uint32_t DR;     /*!< ADC regular data register,                   Address offset: 0x4C */

  uint32_t RESERVED0[0x30 / 4];     /*!< Reserved,                        0x04c - 0x7F */         /* FixMe проверить!!*/
  __IO uint32_t OVSP;   /*!< ADC oversampling register,                   Address offset: 0x80 */ /* FixMe проверить!!*/
  uint32_t RESERVED1[0x30 / 4];     /*!< Reserved,                        0x084 - 0xB3 */         /* FixMe проверить!!*/
  __IO uint32_t CALVAL; /*!< ADC calibration value register,              Address offset: 0x80 */ /* FixMe проверить!!*/
} ADC_TypeDef;


