vishamaev/ChibiOS/os/common/ext/Artery/AT32F4xx/at32f435xx.h
typedef struct {
  __IO uint32_t IDCODE;  /*!< MCU device ID code,               Address offset: 0x00 */
  __IO uint32_t CR;      /*!< Debug MCU configuration register, Address offset: 0x04 */
  __IO uint32_t APB1FZ;  /*!< Debug MCU APB1 freeze register,   Address offset: 0x08 */
  __IO uint32_t APB2FZ;  /*!< Debug MCU APB2 freeze register,   Address offset: 0x0C */
}DBGMCU_TypeDef;

/** 
  * @brief DCMI
  */

typedef struct {
  __IO uint32_t CR;       /*!< DCMI control register 1,                       Address offset: 0x00 */
  __IO uint32_t SR;       /*!< DCMI status register,                          Address offset: 0x04 */
  __IO uint32_t RISR;     /*!< DCMI raw interrupt status register,            Address offset: 0x08 */
  __IO uint32_t IER;      /*!< DCMI interrupt enable register,                Address offset: 0x0C */
  __IO uint32_t MISR;     /*!< DCMI masked interrupt status register,         Address offset: 0x10 */
  __IO uint32_t ICR;      /*!< DCMI interrupt clear register,                 Address offset: 0x14 */
  __IO uint32_t ESCR;     /*!< DCMI embedded synchronization code register,   Address offset: 0x18 */
  __IO uint32_t ESUR;     /*!< DCMI embedded synchronization unmask register, Address offset: 0x1C */
  __IO uint32_t CWSTRTR;  /*!< DCMI crop window start,                        Address offset: 0x20 */
  __IO uint32_t CWSIZER;  /*!< DCMI crop window size,                         Address offset: 0x24 */
  __IO uint32_t DR;       /*!< DCMI data register,                            Address offset: 0x28 */
} DCMI_TypeDef;


// --- DMA ---
/** 
  * @brief DMA Controller
  */

#if 1                 // STM32
typedef struct{
  __IO uint32_t CCR;     /*!< DMA channel x configuration register      */
  __IO uint32_t CNDTR;   /*!< DMA channel x number of data register     */
  __IO uint32_t CPAR;    /*!< DMA channel x peripheral address register */
  __IO uint32_t CMAR;   /*!< DMA channel x memory address register   */
} DMA_Channel_TypeDef;

/**
  * @brief DMA Multiplexer
  */

typedef struct
{
  __IO uint32_t   CCR;    /*!< DMA Multiplexer Channel x Control Register    Address offset: 0x0004 * (channel x) */
}DMAMUX_Channel_TypeDef;


typedef struct{
  __IO uint32_t ISR;   /*!< DMA interrupt status register,      Address offset: 0x00 */
  __IO uint32_t IFCR;  /*!< DMA interrupt flag clear register,  Address offset: 0x04 */
  DMA_Channel_TypeDef ch[7];
  __IO uint32_t MUXSEL;  /*!< DMA MUX selection register, Address offset: 0x100 */
  DMAMUX_Channel_TypeDef MUXC[7];
  DMAMUX_Channel_TypeDef MUXG[4];
}
DMA_TypeDef;




/** 
  * @brief DMA2D Controller
  */

typedef struct{
  __IO uint32_t CR;            /*!< DMA2D Control Register,                         Address offset: 0x00 */
  __IO uint32_t ISR;           /*!< DMA2D Interrupt Status Register,                Address offset: 0x04 */
  __IO uint32_t IFCR;          /*!< DMA2D Interrupt Flag Clear Register,            Address offset: 0x08 */
  __IO uint32_t FGMAR;         /*!< DMA2D Foreground Memory Address Register,       Address offset: 0x0C */
  __IO uint32_t FGOR;          /*!< DMA2D Foreground Offset Register,               Address offset: 0x10 */
  __IO uint32_t BGMAR;         /*!< DMA2D Background Memory Address Register,       Address offset: 0x14 */
  __IO uint32_t BGOR;          /*!< DMA2D Background Offset Register,               Address offset: 0x18 */
  __IO uint32_t FGPFCCR;       /*!< DMA2D Foreground PFC Control Register,          Address offset: 0x1C */
  __IO uint32_t FGCOLR;        /*!< DMA2D Foreground Color Register,                Address offset: 0x20 */
  __IO uint32_t BGPFCCR;       /*!< DMA2D Background PFC Control Register,          Address offset: 0x24 */
  __IO uint32_t BGCOLR;        /*!< DMA2D Background Color Register,                Address offset: 0x28 */
  __IO uint32_t FGCMAR;        /*!< DMA2D Foreground CLUT Memory Address Register,  Address offset: 0x2C */
  __IO uint32_t BGCMAR;        /*!< DMA2D Background CLUT Memory Address Register,  Address offset: 0x30 */
  __IO uint32_t OPFCCR;        /*!< DMA2D Output PFC Control Register,              Address offset: 0x34 */
  __IO uint32_t OCOLR;         /*!< DMA2D Output Color Register,                    Address offset: 0x38 */
  __IO uint32_t OMAR;          /*!< DMA2D Output Memory Address Register,           Address offset: 0x3C */
  __IO uint32_t OOR;           /*!< DMA2D Output Offset Register,                   Address offset: 0x40 */
  __IO uint32_t NLR;           /*!< DMA2D Number of Line Register,                  Address offset: 0x44 */
  __IO uint32_t LWR;           /*!< DMA2D Line Watermark Register,                  Address offset: 0x48 */
  __IO uint32_t AMTCR;         /*!< DMA2D AHB Master Timer Configuration Register,  Address offset: 0x4C */
  uint32_t      RESERVED[236]; /*!< Reserved, 0x50-0x3FF */
  __IO uint32_t FGCLUT[256];   /*!< DMA2D Foreground CLUT,                          Address offset:400-7FF */
  __IO uint32_t BGCLUT[256];   /*!< DMA2D Background CLUT,                          Address offset:800-BFF */
}
DMA2D_TypeDef;
#else             //RT-AT32


/**
  * @brief EDMA Controller
  */


typedef struct{
  __IO uint32_t STS1;   /*!< EDMA status register 1 (EDMA_STS1),     Address offset: 0x00 */
  __IO uint32_t STS2;   /*!< EDMA status register 2 (EDMA_STS2),     Address offset: 0x04 */
  __IO uint32_t CLR1;   /*!< EDMA flag clear register 1 (EDMA_CLR1), Address offset: 0x08 */
  __IO uint32_t CLR2;   /*!< EDMA flag clear register 2 (EDMA_CLR2), Address offset: 0x0C */
} EDMA_TypeDef;


typedef struct{
  __IO uint32_t CTRL;   /*!< EDMA stream-x control register (EDMA_SxCTRL)  */
  __IO uint32_t DTCNT;  /*!< EDMA stream-x data register (EDMA_SxDTCNT)    */
  __IO uint32_t PADDR;  /*!< EDMA stream-x peripheral address register (EDMA_SxPADDR)  */
  __IO uint32_t M0ADDR; /*!< EDMA stream-x memory 0 address register (EDMA_SxM0ADDR)   */
  __IO uint32_t M1ADDR; /*!< EDMA stream-x memory 1 address register (EDMA_SxM1ADDR)   */
  __IO uint32_t FCTRL;  /*!< EDMA stream-x FIFO control register (EDMA_SxFCTRL)        */
} EDMA_Stream_TypeDef;


