vishamaev/ChibiOS/os/common/ext/Artery/AT32F4xx/at32f435xx.h
#define RCC_BDCR_RTCSEL_Pos                (8U)
#define RCC_BDCR_RTCSEL_Msk                (0x3U << RCC_BDCR_RTCSEL_Pos)       /*!< 0x00000300 */
#define RCC_BDCR_RTCSEL                    RCC_BDCR_RTCSEL_Msk
#define RCC_BDCR_RTCSEL_0                  (0x1U << RCC_BDCR_RTCSEL_Pos)       /*!< 0x00000100 */
#define RCC_BDCR_RTCSEL_1                  (0x2U << RCC_BDCR_RTCSEL_Pos)       /*!< 0x00000200 */

#define RCC_BDCR_RTCEN_Pos                 (15U)
#define RCC_BDCR_RTCEN_Msk                 (0x1U << RCC_BDCR_RTCEN_Pos)        /*!< 0x00008000 */
#define RCC_BDCR_RTCEN                     RCC_BDCR_RTCEN_Msk
#define RCC_BDCR_BDRST_Pos                 (16U)
#define RCC_BDCR_BDRST_Msk                 (0x1U << RCC_BDCR_BDRST_Pos)        /*!< 0x00010000 */
#define RCC_BDCR_BDRST                     RCC_BDCR_BDRST_Msk

/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos                  (0U)
#define RCC_CSR_LSION_Msk                  (0x1U << RCC_CSR_LSION_Pos)         /*!< 0x00000001 */
#define RCC_CSR_LSION                      RCC_CSR_LSION_Msk
#define RCC_CSR_LSIRDY_Pos                 (1U)
#define RCC_CSR_LSIRDY_Msk                 (0x1U << RCC_CSR_LSIRDY_Pos)        /*!< 0x00000002 */
#define RCC_CSR_LSIRDY                     RCC_CSR_LSIRDY_Msk
#define RCC_CSR_RMVF_Pos                   (24U)
#define RCC_CSR_RMVF_Msk                   (0x1U << RCC_CSR_RMVF_Pos)          /*!< 0x01000000 */
#define RCC_CSR_RMVF                       RCC_CSR_RMVF_Msk
#define RCC_CSR_BORRSTF_Pos                (25U)
#define RCC_CSR_BORRSTF_Msk                (0x1U << RCC_CSR_BORRSTF_Pos)       /*!< 0x02000000 */
#define RCC_CSR_BORRSTF                    RCC_CSR_BORRSTF_Msk
#define RCC_CSR_PINRSTF_Pos                (26U)
#define RCC_CSR_PINRSTF_Msk                (0x1U << RCC_CSR_PINRSTF_Pos)       /*!< 0x04000000 */
#define RCC_CSR_PINRSTF                    RCC_CSR_PINRSTF_Msk
#define RCC_CSR_PORRSTF_Pos                (27U)
#define RCC_CSR_PORRSTF_Msk                (0x1U << RCC_CSR_PORRSTF_Pos)       /*!< 0x08000000 */
#define RCC_CSR_PORRSTF                    RCC_CSR_PORRSTF_Msk
#define RCC_CSR_SFTRSTF_Pos                (28U)
#define RCC_CSR_SFTRSTF_Msk                (0x1U << RCC_CSR_SFTRSTF_Pos)       /*!< 0x10000000 */
#define RCC_CSR_SFTRSTF                    RCC_CSR_SFTRSTF_Msk
#define RCC_CSR_IWDGRSTF_Pos               (29U)
#define RCC_CSR_IWDGRSTF_Msk               (0x1U << RCC_CSR_IWDGRSTF_Pos)      /*!< 0x20000000 */
#define RCC_CSR_IWDGRSTF                   RCC_CSR_IWDGRSTF_Msk
#define RCC_CSR_WWDGRSTF_Pos               (30U)
#define RCC_CSR_WWDGRSTF_Msk               (0x1U << RCC_CSR_WWDGRSTF_Pos)      /*!< 0x40000000 */
#define RCC_CSR_WWDGRSTF                   RCC_CSR_WWDGRSTF_Msk
#define RCC_CSR_LPWRRSTF_Pos               (31U)
#define RCC_CSR_LPWRRSTF_Msk               (0x1U << RCC_CSR_LPWRRSTF_Pos)      /*!< 0x80000000 */
#define RCC_CSR_LPWRRSTF                   RCC_CSR_LPWRRSTF_Msk
/* Legacy defines */
#define RCC_CSR_PADRSTF                    RCC_CSR_PINRSTF
#define RCC_CSR_WDGRSTF                    RCC_CSR_IWDGRSTF

/********************  Bit definition for RCC_SSCGR register  *****************/
#define RCC_SSCGR_MODPER_Pos               (0U)
#define RCC_SSCGR_MODPER_Msk               (0x1FFFU << RCC_SSCGR_MODPER_Pos)   /*!< 0x00001FFF */
#define RCC_SSCGR_MODPER                   RCC_SSCGR_MODPER_Msk
#define RCC_SSCGR_INCSTEP_Pos              (13U)
#define RCC_SSCGR_INCSTEP_Msk              (0x7FFFU << RCC_SSCGR_INCSTEP_Pos)  /*!< 0x0FFFE000 */
#define RCC_SSCGR_INCSTEP                  RCC_SSCGR_INCSTEP_Msk
#define RCC_SSCGR_SPREADSEL_Pos            (30U)
#define RCC_SSCGR_SPREADSEL_Msk            (0x1U << RCC_SSCGR_SPREADSEL_Pos)   /*!< 0x40000000 */
#define RCC_SSCGR_SPREADSEL                RCC_SSCGR_SPREADSEL_Msk
#define RCC_SSCGR_SSCGEN_Pos               (31U)
#define RCC_SSCGR_SSCGEN_Msk               (0x1U << RCC_SSCGR_SSCGEN_Pos)      /*!< 0x80000000 */
#define RCC_SSCGR_SSCGEN                   RCC_SSCGR_SSCGEN_Msk

/********************  Bit definition for RCC_MISC2 register  *****************/
#define RCC_MISC2_AUTO_STEP_EN_Pos         (4U)
#define RCC_MISC2_AUTO_STEP_EN_Msk         (0x3U << RCC_MISC2_AUTO_STEP_EN_Pos)
#define RCC_MISC2_AUTO_STEP_EN             RCC_MISC2_AUTO_STEP_EN_Msk
#define RCC_MISC2_AUTO_STEP_DIS            (0x0)

#define RCC_MISC2_USB_DIV_Pos              (12U)
#define RCC_MISC2_USB_DIV_Msk              (0x0FU << RCC_MISC2_USB_DIV_Pos)
#define RCC_MISC2_USB_DIV_1_5              (0x00U << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div1.5 to usbclk */
#define RCC_MISC2_USB_DIV_1                (0x01U << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div1 to usbclk */
#define RCC_MISC2_USB_DIV_2_5              (0x02U << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div2.5 to usbclk */
#define RCC_MISC2_USB_DIV_2                (0x03U << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div2 to usbclk */
#define RCC_MISC2_USB_DIV_3_5              (0x04U << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div3.5 to usbclk */
#define RCC_MISC2_USB_DIV_3                (0x05U << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div3 to usbclk */
#define RCC_MISC2_USB_DIV_4_5              (0x06U << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div4.5 to usbclk */
#define RCC_MISC2_USB_DIV_4                (0x07U << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div4 to usbclk */
#define RCC_MISC2_USB_DIV_5_5              (0x08U << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div5.5 to usbclk */
#define RCC_MISC2_USB_DIV_5                (0x09U << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div5 to usbclk */
#define RCC_MISC2_USB_DIV_6_5              (0x0AU << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div6.5 to usbclk */
#define RCC_MISC2_USB_DIV_6                (0x0BU << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div6 to usbclk */
#define RCC_MISC2_USB_DIV_7                (0x0CU << RCC_MISC2_USB_DIV_Pos)     /*!< pllclk div7 to usbclk */

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN_Pos    (2U)
#define RNG_CR_RNGEN_Msk    (0x1U << RNG_CR_RNGEN_Pos)                         /*!< 0x00000004 */
#define RNG_CR_RNGEN        RNG_CR_RNGEN_Msk
#define RNG_CR_IE_Pos       (3U)
#define RNG_CR_IE_Msk       (0x1U << RNG_CR_IE_Pos)                            /*!< 0x00000008 */
#define RNG_CR_IE           RNG_CR_IE_Msk

